cmsis-svd/cmsis-svd/data/Spansion/MB9BF30xN.svd
        <!-- REGISTER "ICU_ICFS32" -->
        <register derivedFrom="ICU_ICFS10">
          <name>ICU_ICFS32</name>
          <description>"ICU ch.3,2 Connecting FRT Select Register"</description>
          <addressOffset>0x61</addressOffset>
        </register>
        <!-- REGISTER "ICU_ICSA10" -->
        <register>
          <name>ICU_ICSA10</name>
          <description>"ICU ch.1,0 Control Register A"</description>
          <addressOffset>0x78</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EG0" -->
            <field>
              <name>EG0</name>
              <description>enables/disables the operation of ICU-ch.(0) and selects a valid edge(s)</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EG1" -->
            <field>
              <name>EG1</name>
              <description>enables/disables the operation of ICU-ch.(1) and selects a valid edge(s)</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICE0" -->
            <field>
              <name>ICE0</name>
              <description>"Generates interrupt, when ""1"" is set to ICSA.ICP0."</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICE1" -->
            <field>
              <name>ICE1</name>
              <description>"Generates interrupt, when ""1"" is set to ICSA.ICP1."</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICP0" -->
            <field>
              <name>ICP0</name>
              <description>Indicates that a valid edge has been detected at ICU ch.(0) and the capture operation has been performed</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICP1" -->
            <field>
              <name>ICP1</name>
              <description>Indicates that a valid edge has been detected at ICU ch.(1) and the capture operation has been performed</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ICU_ICSA32" -->
        <register derivedFrom="ICU_ICSA10">
          <name>ICU_ICSA32</name>
          <description>"ICU ch.3,2 Control Register A"</description>
          <addressOffset>0x7C</addressOffset>
        </register>
        <!-- REGISTER "ICU_ICSB10" -->
        <register>
          <name>ICU_ICSB10</name>
          <description>"ICU ch.1,0 Control Register B"</description>
          <addressOffset>0x79</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IEI0" -->
            <field>
              <name>IEI0</name>
              <description>indicates the latest valid edge of ICU-ch.(0)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IEI1" -->
            <field>
              <name>IEI1</name>
              <description>indicates the latest valid edge of ICU-ch.(1)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ICU_ICSB32" -->
        <register derivedFrom="ICU_ICSB10">
          <name>ICU_ICSB32</name>
          <description>"ICU ch.3,2 Control Register B"</description>
          <addressOffset>0x7D</addressOffset>
        </register>
        <!-- REGISTER "ICU_ICCP0" -->
        <register>
          <name>ICU_ICCP0</name>
          <description>ICU ch.0 Capture value store register</description>
          <addressOffset>0x68</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
        </register>
        <!-- REGISTER "ICU_ICCP1" -->
        <register derivedFrom="ICU_ICCP0">
          <name>ICU_ICCP1</name>
          <description>ICU ch.1 Capture value store register</description>
          <addressOffset>0x6C</addressOffset>
        </register>
        <!-- REGISTER "ICU_ICCP2" -->
        <register derivedFrom="ICU_ICCP0">
          <name>ICU_ICCP2</name>
          <description>ICU ch.2 Capture value store register</description>
          <addressOffset>0x70</addressOffset>
        </register>
        <!-- REGISTER "ICU_ICCP3" -->
        <register derivedFrom="ICU_ICCP0">
          <name>ICU_ICCP3</name>
          <description>ICU ch.3 Capture value store register</description>
          <addressOffset>0x74</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSA" -->
        <register>
          <name>ADCMP_ACSA</name>
          <description>ADCMP Control Register A</description>
          <addressOffset>0xBC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x3F3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CE0" -->
            <field>
              <name>CE0</name>
              <description>enable or disable the operation of ADCMP-ch.0 and select the FRT to be connected</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CE1" -->
            <field>
              <name>CE1</name>
              <description>enable or disable the operation of ADCMP-ch.1 and select the FRT to be connected</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CE2" -->
            <field>
              <name>CE2</name>
              <description>enable or disable the operation of ADCMP-ch.2 and select the FRT to be connected</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL0" -->
            <field>
              <name>SEL0</name>
              <description>which count state FRT should be in to instruct AD conversion to be started at ADCMP-ch.0</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL1" -->
            <field>
              <name>SEL1</name>
              <description>which count state FRT should be in to instruct AD conversion to be started at ADCMP-ch.1</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL2" -->
            <field>
              <name>SEL2</name>
              <description>which count state FRT should be in to instruct AD conversion to be started at ADCMP-ch.2</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACSB" -->
        <register>
          <name>ADCMP_ACSB</name>
          <description>ADCMP Control Register B</description>
          <addressOffset>0xB8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x07</resetValue>
          <resetMask>0x77</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BDIS0" -->
            <field>
              <name>BDIS0</name>
              <description>Disables the buffer function of the ACCP0 and ACCPDN0 registers</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BDIS1" -->
            <field>
              <name>BDIS1</name>
              <description>Disables the buffer function of the ACCP1 and ACCPDN1 registers</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BDIS2" -->
            <field>
              <name>BDIS2</name>
              <description>Disables the buffer function of the ACCP2 and ACCPDN2 registers</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTS0" -->
            <field>
              <name>BTS0</name>
              <description>Performs buffer transfer of the ACCP0 and ACCPDN0 registers upon Peak value detection by FRT</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTS1" -->
            <field>
              <name>BTS1</name>
              <description>Performs buffer transfer of the ACCP1 and ACCPDN1 registers upon Peak value detection by FRT</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTS2" -->
            <field>
              <name>BTS2</name>
              <description>Performs buffer transfer of the ACCP2 and ACCPDN2 registers upon Peak value detection by FRT</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
